CommonSecurityLog
| extend Country=MaliciousIPCountry, Latitude=MaliciousIPLatitude, Confidence=ThreatDescription, Description=ThreatDescription
| where isnotempty(Country)
| project Country,DeviceVendor,DeviceProduct,SimplifiedDeviceAction,SourceIP, DestinationIP, DestinationPort
| summarize count() by Country, SourceIP, DestinationIP, DestinationPort,SimplifiedDeviceAction
| where Country == "Russia"

SecurityEvent
| summarize by Activity // Finding events that includes process names

SecurityEvent
| where EventID == "4688" // '4688' - a new process has been created
| summarize count() by CommandLine, Computer

SecurityEvent
| where EventID == "4688" // '4688' - a new process has been created
| extend process = extract("^(.*?)( |$)",1,CommandLine) //get only the process name
| summarize count() by process, Process, Computer
//summarizes with columns 'process'(location),'Processes'(.exe), 'Computer', 'count'

SecurityEvent
| where TimeGenerated between (ago(14d)..ago(7d))//start with the time filter
| where EventID == "4624"
| where Computer startswith "App" //case insensitive
| summarize count() by Computer //count per computer

SecurityEvent
| where Computer startswith "DC"
| where EventID == "4688"
| summarize count() by Computer, bin(TimeGenerated, 1h)
| render timechart

SecurityAlert | union SecurityEvent
| summarize
    SecurityAlerts = countif(Type == "SecurityAlert"), //custom variable
    SecurityEvents = countif(Type == "SecurityEvent") //custom variable
    by bin (TimeGenerated, 1h)
| extend Ratio = SecurityAlerts * 1.0 / SecurityEvents //Ratio is a custom variable
| project SecurityEvents, SecurityAlerts, Ratio //Selecting the fields to display

SecurityAlert
| mv-expand entity=todynamic(Entities)
| where entity.Type == "account"
| extend Account = strcat(entity.NTDomain, "\\",entity.Name)
| summarize dcount(SystemAlertId) by Account
| join kind=leftouter (SecurityEvent | summarize make_set(EventID) by Account) on Account | project-away Account1

WindowsFirewall | limit 10 // Identify fields: CommunicationDirection, FirewallAction, SourceIP

WindowsFirewall
 | summarize by CommunicationDirection, FirewallAction //Checking for possible values

WindowsFirewall
 | where TimeGenerated > ago(7d)
 | where FirewallAction == "DROP" and CommunicationDirection == "RECEIVE"
 | summarize count() by SourceIP
 | where count_ > 10
 | sort by count_ //Sort by a specific column

Windows
